Repository: Mohamed-python/Django-Diyarna
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar

source: Welcome
ar: مرحبًا

source: Diyarna
ar: ديارنا

source: Donate Now
ar: تبرع الآن

source: Donate
ar: تبرع

source: Goal
ar: الهدف

source: Collected
ar: جمع

source: Complete
ar: مكتمل

source: 0.0 EGP
ar: 0.0 جنيه

source: The Best Place to Donate
ar: أفضل مكان للتبرع

source: Hope for Tomorrow
ar: أمل الغد

source: Support Those in Need
ar: شارك في دعم المحتاجين

source: Hand of Giving
ar: يد العطاء

source: Be Part of the Good
ar: كن جزءًا من الخير

source: Previous
ar: السابق

source: Next
ar: التالي

source: Humanitarian situations
ar: الحالات الإنسانية

source: Choose a case and help according to your ability.
ar: اختر حالة وساعد حسب قدرتك

source: View all cases
ar: عرض كل الحالات

source: There are no cases currently.
ar: لا توجد حالات حالياً

source: Products
ar: المنتجات

source: View all products
ar: عرض كل المنتجات

source: News
ar: الأخبار

source: Read More
ar: اقرأ المزيد

source: View All News
ar: عرض المزيد

source: No news available
ar: لا توجد أخبار حالياً

source: Stay tuned for updates
ar: تابعنا لمعرفة الجديد قريباً

source: Back to all cases
ar: العودة لكل الحالات

source: Added to cart
ar: تمت الإضافة للسلة

source: views
ar: مشاهدة
